import React from "react";
import "./spa.css";
import spa from "./spa.png";

const Spa = () => {
    return(
        <div className="spa">
            <h1>Ինչ է Single Page Application-ը SPA</h1>
            <p>
                նախկինում կայքերը բաղկացած էին բազմաթիվ HTML էջերից: 
                Երբ Սեղմում էինք հղումների վրա, օրինակ ցանկանում էինք տեսնել մեր նոր message ները բրաուզերը այդ հղումներից նոր HTML էջեր է բեռնում,
                և թարմացնում մեր ողջ կայքը ամեն մի նոր գործողություն անելու համար բռաուզերը մեզ ուղարկում եր նոր HTML էջ։
            </p>
            <img src={spa} />
            <p>
                2010-ականների սկզբին հայտնվեց նոր մոտեցում:
                Դա կոչվում է SPA - Single Page Application:
                Եթե ​​դուք օգտվել եք Facebook.com-ից, ապա արդեն հանդիպել եք նման մեխանիզմին։
            </p>
            <p>
            SPA-ն աշխատում է այսպես՝ երբ օգտատերը բացում է էջը, բրաուզերը միանգամից բեռնում է հավելվածի բոլոր կոդը։
             Բայց դա ցույց է տալիս միայն կոնկրետ մոդուլ՝ կայքի այն հատվածը, 
             որն անհրաժեշտ է օգտագործողին։ Երբ օգտատերը նավարկում է հավելվածի մեկ այլ մաս, բրաուզերը վերցնում է արդեն ներբեռնված տվյալները և ցույց
            տալիս նրան։ Եվ անհրաժեշտության դեպքում այն ​​դինամիկ կերպով բեռնում է անհրաժեշտ բովանդակությունը սերվերից՝ առանց էջը թարմացնելու։
            Մի կողմից՝ նման հավելվածները արագ են աշխատում և ավելի քիչ են բեռնում սերվերը։
             Մյուս կողմից, նրանք սկզբում ավելի շատ բեռնում են պահանջում:
            </p>
        </div>
    )
}

export default Spa;